# Entity Constructor (Schema) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Entity Constructor (Schema)
Entity Class See Also
---
Creates a new Entity corresponding to the Schema.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Entity(
	Schema schema
)
```

Visual Basic
---
```text
Public Sub New ( _
	schema As Schema _
)
```

Visual C++
---
```text
public:
Entity(
	Schema^ schema
)
```

# ### Parameters
schema
    Type: Autodesk.Revit.DB.ExtensibleStorage..::..Schema
# Remarks
You can store the newly created Entity in an Element or in another Entity. If you do not have write access to the Schema, an exception will be thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Writing of Entities of this Schema is not allowed to the current add-in. |

# See Also
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace